In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\futurense.mile-bl-4171-la\anaconda3\lib\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\futurense.mile-bl-4171-la\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector

In [3]:
# Importing module
import mysql.connector

# Creating connection object
mydb = mysql.connector.connect(
	host = "localhost",
	user = "root",
	password = "root"
)

# Printing the connection object
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000026C26D51DC0>

In [4]:
# Importing module
import mysql.connector

# Creating connection object
mydb = mysql.connector.connect(
	host = "localhost",
	user = "root",
	password = "root"
)

cursor = mydb.cursor()

# Show database
cursor.execute("SHOW DATABASES")

for x in cursor:
    print(x)

('classicmodels',)
('daytwoexercise',)
('db',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('walmart',)
('world',)

In [17]:
# Importing module
import mysql.connector
import pandas as pd

# Creating connection object
mydb = mysql.connector.connect(
	host = "localhost",
	user = "root",
	password = "root"
)

cursor = mydb.cursor()

#create query 
query1="show databases;"
query2="use world;"
query3="show tables;"
query4="select * from city;"
# query5="sp_help city"

# Show database
# cursor.execute(query1)
cursor.execute(query2)
# cursor.execute(query5)
# print(cursor)

# cursor.execute(query3)
cursor.execute(query4)

# for x in cursor:
#     print(x)

df=pd.DataFrame(cursor)
# s1=df[1].copy().squeeze()
# s1.sort_values(ignore_index=True,inplace=True)
# print(s1)
df

         0               1    2              3        4
0        1           Kabul  AFG          Kabol  1780000
1        2        Qandahar  AFG       Qandahar   237500
2        3           Herat  AFG          Herat   186800
3        4  Mazar-e-Sharif  AFG          Balkh   127800
4        5       Amsterdam  NLD  Noord-Holland   731200
...    ...             ...  ...            ...      ...
4074  4075      Khan Yunis  PSE     Khan Yunis   123175
4075  4076          Hebron  PSE         Hebron   119401
4076  4077        Jabaliya  PSE     North Gaza   113901
4077  4078          Nablus  PSE         Nablus   100231
4078  4079           Rafah  PSE          Rafah    92020

[4079 rows x 5 columns]

In [20]:
df22= pd.read_sql(query4,mydb)

In [21]:
df22

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

In [36]:
cursor = mydb.cursor()

# reduce number of calls to server on inserts
cursor.fast_executemany = True

In [40]:
# insert only the key and the updated values
subset = df22[['Name','CountryCode']]
print(subset)
# form SQL insert statement
columnsk = ", ".join(subset.columns)
print(columnsk)
values = '('+', '.join(['?']*len(subset.columns))+')'
# # insert
statement = "INSERT INTO #temp_TableName ("+columnsk+") VALUES "+values
insert = [tuple(x) for x in subset.values]

cursor.executemany(statement, insert)

                Name CountryCode
0              Kabul         AFG
1           Qandahar         AFG
2              Herat         AFG
3     Mazar-e-Sharif         AFG
4          Amsterdam         NLD
...              ...         ...
4074      Khan Yunis         PSE
4075          Hebron         PSE
4076        Jabaliya         PSE
4077          Nablus         PSE
4078           Rafah         PSE

[4079 rows x 2 columns]
Name, CountryCode

InterfaceError: Failed executing the operation; Not all parameters were used in the SQL statement